# Pandas DataFrame and Series

In [1]:
# Pandas is foundamental in data analysis
# pandas is used for many data manipulation operations 
# used also for cleaning, providing data structures series and data frames 
# Series: 1D array | DataFrame: 2D size-mutable heterogeneus tabular object with labeled axes (rows, columns)
# 
# numpy array can be converted into series, similarly 2D numpy array can be converted in data frame

import pandas as pd

In [2]:
# Series 
# a series is a 1D array-like object that can hold any data type (similar to a column in a table)

data = [1, 2, 3, 4, 5]
series = pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
# also you can create series from dict elements 
data = {'a': 1, 'b': 2, 'c': 3}

series_dict = pd.Series(data)
print(series_dict)
# the dict key become the indices, and the val become the element

a    1
b    2
c    3
dtype: int64

In [4]:
# I can use a different index based on req
data = [10, 20, 30]

# in excel files opening (csv) Pandas help in manipulating it
index = ['a', 'b', 'c']

series = pd.Series(data, index)
print(series)

a    10
b    20
c    30
dtype: int64

In [6]:
# DataFrame

# 2D mutable heterogeneus tabular data structured in row, columns... 
# similar to an excel sheet (multi dim data)
# I can read it easily and convert it

# it is possible to create a data frame from a dictionary of list 
data = {
    'Name':['Ale', 'John', 'Jake'], 
    'Age' :[24, 30, 45], 
    'City':['Catania', 'Florida', 'Messina']
}

df = pd.DataFrame(data)
print(df)
print(type(df))

   Name  Age     City
0   Ale   24  Catania
1  John   30  Florida
2  Jake   45  Messina
<class 'pandas.core.frame.DataFrame'>

In [7]:
import numpy as np 
np.array(df)

array([['Ale', 24, 'Catania'],
       ['John', 30, 'Florida'],
       ['Jake', 45, 'Messina']], dtype=object)

In [44]:
# I can convert in numpy array from pandas data frame 
# Create a data frame from a list of dictionaries 

data = [
    {'Name':'Ale', 'Age': 24, 'City': 'Catania'}, 
    {'Name':'Gio', 'Age': 26, 'City': 'Messina'}, 
    {'Name':'Bro', 'Age': 36, 'City': 'Palermo'},
    {'Name':'Ture', 'Age': 60, 'City': 'Siracusa'} 
]

df = pd.DataFrame(data)
print(df)
# Alternartive way!

   Name  Age      City
0   Ale   24   Catania
1   Gio   26   Messina
2   Bro   36   Palermo
3  Ture   60  Siracusa

In [9]:
# Most of the time we use a df, we work with big csv or excel files

df = pd.read_csv('sales_data.csv')
# to see first 5 elements 
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [10]:
# last 5 elements 
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [12]:
# To access data from data frame 
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [ ]:
# To take elements with respect to names
df['Product Name']
# I extract column from the name of the column

0                                        iPhone 14 Pro
1                                     Dyson V11 Vacuum
2                                     Levi's 501 Jeans
3                                    The Da Vinci Code
4                              Neutrogena Skincare Set
                            ...
235    Nespresso Vertuo Next Coffee and Espresso Maker
236                          Nike Air Force 1 Sneakers
237             The Handmaid's Tale by Margaret Atwood
238               Sunday Riley Luna Sleeping Night Oil
239                         Yeti Rambler 20 oz Tumbler
Name: Product Name, Length: 240, dtype: object

In [17]:
# If I pick a one column it become a series 
print(type(df["Product Name"]))

<class 'pandas.core.series.Series'>

In [ ]:
# ROW
df.loc[0] # Loc take the raw values

Transaction ID              10001
Date                   2024-01-01
Product Category      Electronics
Product Name        iPhone 14 Pro
Units Sold                      2
Unit Price                 999.99
Total Revenue             1999.98
Region              North America
Payment Method        Credit Card
Name: 0, dtype: object

In [ ]:
# COLUMNS
# Column index by location 
df.iloc[0]

Transaction ID              10001
Date                   2024-01-01
Product Category      Electronics
Product Name        iPhone 14 Pro
Units Sold                      2
Unit Price                 999.99
Total Revenue             1999.98
Region              North America
Payment Method        Credit Card
Name: 0, dtype: object

In [28]:
df.loc[0][2]

/tmp/ipykernel_11914/2880214942.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][2]

'Electronics'

In [29]:
df.iloc[0][2]

/tmp/ipykernel_11914/2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'Electronics'

In [26]:
# index locaton umerically can be used to access data 

# another function allow to access a specific element 
df['Product Name']

# how to get an element over a column name 
df.at[1,'Product Name']

'Dyson V11 Vacuum'

In [27]:
# Accessing specified elemnt with iat 
# you can give row/column 
df.iat[2, 2]

'Clothing'

In [45]:
# data manipulation with data frames 
df = pd.DataFrame(data)

In [46]:
df['Salary'] = [1200, 200, 650, 2000]
df
# adding a column

   Name  Age      City  Salary
0   Ale   24   Catania    1200
1   Gio   26   Messina     200
2   Bro   36   Palermo     650
3  Ture   60  Siracusa    2000

In [47]:
# remove a column 
df.drop('Salary', axis=1) # you need to specify the usage of column and not row
# But it is done just in place, it returns a df

   Name  Age      City
0   Ale   24   Catania
1   Gio   26   Messina
2   Bro   36   Palermo
3  Ture   60  Siracusa

In [48]:
df = df.drop('Salary', axis=1)

In [49]:
# otherwise you specify in place
df.drop('City', axis=1, inplace=True)

In [50]:
# Add age to all column +1
df['Age'] = df["Age"]+1

In [51]:
df

   Name  Age
0   Ale   25
1   Gio   27
2   Bro   37
3  Ture   61

In [52]:
# to drop based in row
df.drop(0)

   Name  Age
1   Gio   27
2   Bro   37
3  Ture   61

In [53]:
df.drop(0, inplace=True)

In [54]:
df

   Name  Age
1   Gio   27
2   Bro   37
3  Ture   61

In [55]:
df = pd.read_csv('sales_data.csv')
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [ ]:
print(df.dtypes)
print('\n')
print(df.describe())
# describe allow to access statistical elements in the data frame in a single way

Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object


       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [ ]:
# additional data operation and manipulation in bext notebook